In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [66]:
#data_df = pd.read_csv("train.csv")
test_df = pd.read_csv("test.csv")

In [16]:
data_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,NaN,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,NaN,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,NaN,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [18]:
data_df["Age"]=data_df["Age"].fillna(data_df["Age"].median())

In [19]:
data_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.361582,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,13.019697,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [26]:

data_df.drop(["Ticket"],axis=1,inplace=True)

In [27]:
data_df.head(10)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S
5         0       3    male  28.0      0      0   8.4583   NaN        Q
6         0       1    male  54.0      0      0  51.8625   E46        S
7         0       3    male   2.0      3      1  21.0750   NaN        S
8         1       3  female  27.0      0      2  11.1333   NaN        S
9         1       2  female  14.0      1      0  30.0708   NaN        C

In [28]:
from sklearn.preprocessing import LabelEncoder

In [29]:
le=LabelEncoder()

In [30]:
le.fit(["male","female"])

LabelEncoder()

In [32]:
val=le.transform(data_df["Sex"])

In [34]:
data_df["Sex"]=val

In [41]:
data_df.head(10)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    1  22.0      1      0   7.2500   NaN        S
1         1       1    0  38.0      1      0  71.2833   C85        C
2         1       3    0  26.0      0      0   7.9250   NaN        S
3         1       1    0  35.0      1      0  53.1000  C123        S
4         0       3    1  35.0      0      0   8.0500   NaN        S
5         0       3    1  28.0      0      0   8.4583   NaN        Q
6         0       1    1  54.0      0      0  51.8625   E46        S
7         0       3    1   2.0      3      1  21.0750   NaN        S
8         1       3    0  27.0      0      2  11.1333   NaN        S
9         1       2    0  14.0      1      0  30.0708   NaN        C

In [42]:
data_df.drop(["Cabin"],axis=1,inplace = True)

In [44]:
data_df.head(10)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    1  22.0      1      0   7.2500        S
1         1       1    0  38.0      1      0  71.2833        C
2         1       3    0  26.0      0      0   7.9250        S
3         1       1    0  35.0      1      0  53.1000        S
4         0       3    1  35.0      0      0   8.0500        S
5         0       3    1  28.0      0      0   8.4583        Q
6         0       1    1  54.0      0      0  51.8625        S
7         0       3    1   2.0      3      1  21.0750        S
8         1       3    0  27.0      0      2  11.1333        S
9         1       2    0  14.0      1      0  30.0708        C

In [45]:
le.fit(["S","C","Q"])

LabelEncoder()

In [46]:
le.classes_

array(['C', 'Q', 'S'],
      dtype='|S1')

In [37]:
from sklearn.linear_model import LogisticRegression

In [38]:
lr = LogisticRegression()

In [48]:
lr.fit(data_df[["Pclass","Sex","Age","SibSp","Parch","Fare"]],data_df["Survived"])

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [52]:
test_df.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

In [67]:
test_df.drop(["Name","Cabin","Embarked"],axis=1,inplace=True)

In [68]:
le.fit(["male","female"])

LabelEncoder()

In [69]:
test_df["Sex"]=le.transform(test_df["Sex"])

In [73]:
test_df.describe()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,2.265550,0.636364,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.841838,0.481622,14.181209,0.896760,0.981429,55.907576
min,892.000000,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,1.000000,0.000000,NaN,0.000000,0.000000,NaN
50%,1100.500000,3.000000,1.000000,NaN,0.000000,0.000000,NaN
75%,1204.750000,3.000000,1.000000,NaN,1.000000,0.000000,NaN
max,1309.000000,3.000000,1.000000,76.000000,8.000000,9.000000,512.329200

In [76]:
test_df["Age"]=test_df["Age"].fillna(test_df["Age"].median())

In [77]:
test_df["Fare"]= test_df["Fare"].fillna(test_df["Fare"].median())

In [78]:
pred_val = lr.predict(test_df[["Pclass","Sex","Age","SibSp","Parch","Fare"]])

In [81]:
new_df = pd.DataFrame(test_df["PassengerId"])

In [83]:
new_df["survived"]=pred_val

In [87]:
new_df.to_csv("results.csv",index=False)